public/ephemeris/2025-03-24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>
<div id="outline-container-orga3aaa7d" class="outline-2">
<h2 id="orga3aaa7d">2025-03-24</h2>
<div class="outline-text-2" id="text-orga3aaa7d">
<p>
Today I stumbled across some really interesting things and I wanted to
share it via this document. If you know me, I am subscribed to quite a
number of mailing lists, one of them being gmane announce. There isn't
a particular reason why I subscribed to this other than curiosity,
messages are rare so it does not bother me.
</p>

<p>
Today a new mailing list was registered for the community around
XEphem. Now, I didn't know what was XEphem prior to reading this
mailing list, but now I am super happy to have discovered it. EXphem
is a "scientific-grade interactive astronomical ephemeris package".
The word Ephemeris comes from greek and it means diary or journal.
In astronomy, it refers to a book of tables describing the trajectory
of astronomical objects. Those books were used and are still used
today (in a more modern fashion) to navigate the sky and to study
celestial bodies.
</p>

<p>
<a href="https://xephem.github.io/XEphem/Site/xephem.html">XEphem</a> is a powerful MIT licensed software with so many
functionalities and a look from the 90', you know this is a good
software. Even though it is practically useless to me, I started
playing with the program. Is is packaged on variaous linux
distributions and even on other operating systems such as FreeBSD and
Solaris. It looks amazing to me, I encourage you to take a look at it,
it is full of functionalities. Also the program is written in C,
beautiful C.
</p>

<p>
I then read the wikipedia page and discovered so many things. First,
cilivizations have been making ephemeris since the Babylonians in the
1st millennium BC. Moreover, the term "epoch" in astronomy refers to
a moment in time used as a reference point for some other astronomical
quantity, what is interesting is that the calendars used in astronomy
are not the same as the terrestrial ones, so sometimes there are
funny dates such as January 0.
</p>

<p>
Overall, it was fun going on a different place where I know close to
nothing about and be intrigued this much like a kid.
</p>

<p>
Some other interesting things. Someone made a <a href="https://www.reddit.com/r/emacs/comments/1jhjgnu/the_book_of_the_church_of_emacs_satirical_ten/">funny reddit post</a> about
the 10 rules of the emacs church that was fun to read. Also, another
blogger I follow shared some photos of flowers in his city and I feel
inspired to do the same in the following days.
</p>

<p>
One last thing. Today Linux 6.14 released and the usual message from
Linus made me laugh:
</p>

<div class="org-src-container">
<pre class="src src-nil">So it's early Monday morning (well - early for me, I'm not really a
morning person), and I'd love to have some good excuse for why I
didn't do the 6.14 release yesterday on my regular Sunday afternoon
release schedule. 

I'd like to say that some important last-minute thing came up and
delayed things. 

But no. It's just pure incompetence. 
</pre>
</div>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
